(function () {
  'use strict';

  window.MPRO_SOURCE_CATALOG = Object.freeze({
    "objects": [
      {
        "fieldId": "ro_1_1",
        "source": "Реестр объектов",
        "label": "№№"
      },
      {
        "fieldId": "ro_1_2",
        "source": "Реестр объектов",
        "label": "Ссылка на дашборд"
      },
      {
        "fieldId": "ro_1_3",
        "source": "Реестр объектов",
        "label": "УИН"
      },
      {
        "fieldId": "ro_1_4",
        "source": "Реестр объектов",
        "label": "Код ДС"
      },
      {
        "fieldId": "ro_1_5",
        "source": "Реестр объектов",
        "label": "Наименование объекта"
      },
      {
        "fieldId": "ro_1_6",
        "source": "Реестр объектов",
        "label": "ТЭП"
      },
      {
        "fieldId": "ro_1_7",
        "source": "Реестр объектов",
        "label": "Статус"
      },
      {
        "fieldId": "ro_1_8",
        "source": "Реестр объектов",
        "label": "ГРБС"
      },
      {
        "fieldId": "ro_1_9",
        "source": "Реестр объектов",
        "label": "Заказчик"
      },
      {
        "fieldId": "ro_1_10",
        "source": "Реестр объектов",
        "label": "Генподрядчик"
      },
      {
        "fieldId": "ro_1_11",
        "source": "Реестр объектов",
        "label": "Плановый ввод по директивному графику (по дашборду)"
      },
      {
        "fieldId": "ro_1_12",
        "source": "Реестр объектов",
        "label": "График  ВВЕ 26-30"
      },
      {
        "fieldId": "ro_1_13",
        "source": "Реестр объектов",
        "label": "График ВВЕ год"
      }
    ],
    "sm": [
      {
        "fieldId": "sm_1_1",
        "source": "Строительный мониторинг",
        "label": "Код АНО СМГ"
      },
      {
        "fieldId": "sm_1_2",
        "source": "Строительный мониторинг",
        "label": "Чек-лист"
      },
      {
        "fieldId": "sm_1_3",
        "source": "Строительный мониторинг",
        "label": "Я.Диск"
      },
      {
        "fieldId": "sm_1_4",
        "source": "Строительный мониторинг",
        "label": "Координаты"
      },
      {
        "fieldId": "sm_1_5",
        "source": "Строительный мониторинг",
        "label": "Дата мониторинга"
      },
      {
        "fieldId": "sm_1_10",
        "source": "Строительный мониторинг",
        "label": "Строительная готовность (план)"
      },
      {
        "fieldId": "sm_1_6",
        "source": "Строительный мониторинг",
        "label": "Строительная готовность (факт)"
      },
      {
        "fieldId": "sm_1_9",
        "source": "Строительный мониторинг",
        "label": "Кол-во людей (план)"
      },
      {
        "fieldId": "sm_1_7",
        "source": "Строительный мониторинг",
        "label": "Кол-во людей (факт)"
      },
      {
        "fieldId": "sm_1_8",
        "source": "Строительный мониторинг",
        "label": "Автослайдер"
      }
    ],
    "ksg": [
      {
        "fieldId": "ksg_2_2",
        "source": "КСГ",
        "label": "Получение разрешения на строительство по эталонному графику (План)"
      },
      {
        "fieldId": "ksg_2_3",
        "source": "КСГ",
        "label": "Получение разрешения на строительство по эталонному графику (Факт)"
      },
      {
        "fieldId": "ksg_4_2",
        "source": "КСГ",
        "label": "Передача строительной площадки подрядчику по эталонному графику (План)"
      },
      {
        "fieldId": "ksg_4_3",
        "source": "КСГ",
        "label": "Передача строительной площадки подрядчику по эталонному графику (Факт)"
      },
      {
        "fieldId": "ksg_5_1",
        "source": "КСГ",
        "label": "Начало СМР по контракту, эталонному графику (Контракт)"
      },
      {
        "fieldId": "ksg_5_2",
        "source": "КСГ",
        "label": "Начало СМР по контракту, эталонному графику (План)"
      },
      {
        "fieldId": "ksg_5_3",
        "source": "КСГ",
        "label": "Начало СМР по контракту, эталонному графику (Факт)"
      },
      {
        "fieldId": "ksg_6_1",
        "source": "КСГ",
        "label": "Окончание СМР по контракту, эталонному графику (Контракт)"
      },
      {
        "fieldId": "ksg_6_2",
        "source": "КСГ",
        "label": "Окончание СМР по контракту, эталонному графику (План)"
      },
      {
        "fieldId": "ksg_6_3",
        "source": "КСГ",
        "label": "Окончание СМР по контракту, эталонному графику (Факт)"
      },
      {
        "fieldId": "ksg_8_2",
        "source": "КСГ",
        "label": "Получение актов технологического присоединения по эталонному графику (План)"
      },
      {
        "fieldId": "ksg_8_3",
        "source": "КСГ",
        "label": "Получение актов технологического присоединения по эталонному графику (Факт)"
      },
      {
        "fieldId": "ksg_9_2",
        "source": "КСГ",
        "label": "Формирование папки ЗОС по эталонному графику (План)"
      },
      {
        "fieldId": "ksg_9_3",
        "source": "КСГ",
        "label": "Формирование папки ЗОС по эталонному графику (Факт)"
      },
      {
        "fieldId": "ksg_10_2",
        "source": "КСГ",
        "label": "Получение ЗОС по эталонному графику (План)"
      },
      {
        "fieldId": "ksg_10_3",
        "source": "КСГ",
        "label": "Получение ЗОС по эталонному графику (Факт)"
      },
      {
        "fieldId": "ksg_12_1",
        "source": "КСГ",
        "label": "Получение РВ по контракту, эталонному графику (Контракт)"
      },
      {
        "fieldId": "ksg_12_2",
        "source": "КСГ",
        "label": "Получение РВ по контракту, эталонному графику (План)"
      },
      {
        "fieldId": "ksg_12_3",
        "source": "КСГ",
        "label": "Получение РВ по контракту, эталонному графику (Факт)"
      },
      {
        "fieldId": "ksg_12_4",
        "source": "КСГ",
        "label": "Получение РВ по контракту, эталонному графику (№ РВ)"
      }
    ],
    "suid": [
      {
        "fieldId": "suid_1_1",
        "source": "Замечания СУИД",
        "label": "Бытовые помещения\n(всего)"
      },
      {
        "fieldId": "suid_1_2",
        "source": "Замечания СУИД",
        "label": "Бытовые помещения\n(в работе)"
      },
      {
        "fieldId": "suid_1_3",
        "source": "Замечания СУИД",
        "label": "Бытовые помещения\n(просрочено)"
      },
      {
        "fieldId": "suid_2_1",
        "source": "Замечания СУИД",
        "label": "Временные ограждения\n(всего)"
      },
      {
        "fieldId": "suid_2_2",
        "source": "Замечания СУИД",
        "label": "Временные ограждения\n(в работе)"
      },
      {
        "fieldId": "suid_2_3",
        "source": "Замечания СУИД",
        "label": "Временные ограждения\n(просрочено)"
      },
      {
        "fieldId": "suid_3_1",
        "source": "Замечания СУИД",
        "label": "Культура производства\n(всего)"
      },
      {
        "fieldId": "suid_3_2",
        "source": "Замечания СУИД",
        "label": "Культура производства\n(в работе)"
      },
      {
        "fieldId": "suid_3_3",
        "source": "Замечания СУИД",
        "label": "Культура производства\n(просрочено)"
      },
      {
        "fieldId": "suid_4_1",
        "source": "Замечания СУИД",
        "label": "Качество строительства\n(всего)"
      },
      {
        "fieldId": "suid_4_2",
        "source": "Замечания СУИД",
        "label": "Качество строительства\n(в работе)"
      },
      {
        "fieldId": "suid_4_3",
        "source": "Замечания СУИД",
        "label": "Качество строительства\n(просрочено)"
      },
      {
        "fieldId": "suid_5_1",
        "source": "Замечания СУИД",
        "label": "Неустраненные замечания/просрочено), шт\nБытовые помещения"
      },
      {
        "fieldId": "suid_5_2",
        "source": "Замечания СУИД",
        "label": "Неустраненные замечания/просрочено), шт\nВременные ограждения"
      },
      {
        "fieldId": "suid_5_3",
        "source": "Замечания СУИД",
        "label": "Неустраненные замечания/просрочено), шт\nКультура производства"
      },
      {
        "fieldId": "suid_5_4",
        "source": "Замечания СУИД",
        "label": "Неустраненные замечания/просрочено), шт\nКачество строительства"
      },
      {
        "fieldId": "suid_5_5",
        "source": "Замечания СУИД",
        "label": "Дата обновления информации\n(Замечания СУИД обновление данных осуществляется в 11-30 и 18-00)"
      }
    ],
    "lb": [
      {
        "fieldId": "lb_1_1",
        "source": "Лаборатория",
        "label": "IRI"
      },
      {
        "fieldId": "lb_1_2",
        "source": "Лаборатория",
        "label": "Керн"
      },
      {
        "fieldId": "lb_1_3",
        "source": "Лаборатория",
        "label": "Бетон"
      },
      {
        "fieldId": "lb_1_4",
        "source": "Лаборатория",
        "label": "Прочие исследования"
      },
      {
        "fieldId": "lb_1_5",
        "source": "Лаборатория",
        "label": "IRI\nвсего"
      },
      {
        "fieldId": "lb_1_6",
        "source": "Лаборатория",
        "label": "IRI\nне соответствует"
      },
      {
        "fieldId": "lb_1_7",
        "source": "Лаборатория",
        "label": "Керн\nвсего"
      },
      {
        "fieldId": "lb_1_8",
        "source": "Лаборатория",
        "label": "Керн\nне соответствует"
      },
      {
        "fieldId": "lb_1_9",
        "source": "Лаборатория",
        "label": "Бетон\nвсего"
      },
      {
        "fieldId": "lb_1_10",
        "source": "Лаборатория",
        "label": "Бетон\nне соответствует"
      },
      {
        "fieldId": "lb_1_11",
        "source": "Лаборатория",
        "label": "Прочие исследования\nвсего"
      },
      {
        "fieldId": "lb_1_12",
        "source": "Лаборатория",
        "label": "Прочие исследования\nне соотвтетствует"
      }
    ],
    "ppr": [
      {
        "fieldId": "ppr_1_1",
        "source": "Комплексная оценка объекта",
        "label": "Руководитель проекта (Заказчик)"
      },
      {
        "fieldId": "ppr_1_2",
        "source": "Комплексная оценка объекта",
        "label": "Контактные данные"
      },
      {
        "fieldId": "ppr_1_3",
        "source": "Комплексная оценка объекта",
        "label": "Проблемные вопросы (Строительный мониторинг)"
      },
      {
        "fieldId": "ppr_1_8",
        "source": "Комплексная оценка объекта",
        "label": "Проблемные вопросы (лаборатория)"
      },
      {
        "fieldId": "ppr_1_4",
        "source": "Комплексная оценка объекта",
        "label": "Фактическое состояние объекта"
      },
      {
        "fieldId": "ppr_1_5",
        "source": "Комплексная оценка объекта",
        "label": "Дата прогноза фактического ввода"
      },
      {
        "fieldId": "ppr_1_6",
        "source": "Комплексная оценка объекта",
        "label": "Риск срыва сроков"
      },
      {
        "fieldId": "ppr_1_7",
        "source": "Комплексная оценка объекта",
        "label": "Начало итоговой проверки МГСН (факт)"
      }
    ],
    "mgz": [
      {
        "fieldId": "mgz_1_3",
        "source": "МГЗ",
        "label": "Номер контракта"
      },
      {
        "fieldId": "mgz_1_1",
        "source": "МГЗ",
        "label": "Дата заключения контракта (УК/СМР)"
      },
      {
        "fieldId": "mgz_1_2",
        "source": "МГЗ",
        "label": "Дата исполнения по контракту"
      },
      {
        "fieldId": "mgz_1_4",
        "source": "МГЗ",
        "label": "Продление по контракту"
      },
      {
        "fieldId": "mgz_1_5",
        "source": "МГЗ",
        "label": "Сумма контракта, млрд"
      },
      {
        "fieldId": "mgz_1_6",
        "source": "МГЗ",
        "label": "Профинансировано, млрд"
      },
      {
        "fieldId": "mgz_1_7",
        "source": "МГЗ",
        "label": "% освоения бюджета"
      }
    ]
  });
})();
