(function () {
  'use strict';

  window.MPRO_SOURCE_CATALOG = Object.freeze({
    "objects": [
      {
        "fieldId": "ro_1_1",
        "source": "Реестр объектов",
        "label": "№№"
      },
      {
        "fieldId": "ro_1_2",
        "source": "Реестр объектов",
        "label": "Ссылка на дашборд"
      },
      {
        "fieldId": "ro_1_3",
        "source": "Реестр объектов",
        "label": "УИН"
      },
      {
        "fieldId": "ro_1_4",
        "source": "Реестр объектов",
        "label": "Код ДС"
      },
      {
        "fieldId": "ro_1_5",
        "source": "Реестр объектов",
        "label": "Наименование объекта"
      },
      {
        "fieldId": "ro_1_6",
        "source": "Реестр объектов",
        "label": "ТЭП"
      },
      {
        "fieldId": "ro_1_7",
        "source": "Реестр объектов",
        "label": "Статус"
      },
      {
        "fieldId": "ro_1_8",
        "source": "Реестр объектов",
        "label": "ГРБС"
      },
      {
        "fieldId": "ro_1_9",
        "source": "Реестр объектов",
        "label": "Заказчик"
      },
      {
        "fieldId": "ro_1_10",
        "source": "Реестр объектов",
        "label": "Генподрядчик"
      },
      {
        "fieldId": "ro_1_11",
        "source": "Реестр объектов",
        "label": "Плановый ввод по директивному графику (по дашборду)"
      },
      {
        "fieldId": "ro_1_12",
        "source": "Реестр объектов",
        "label": "График  ВВЕ 26-30"
      },
      {
        "fieldId": "ro_1_13",
        "source": "Реестр объектов",
        "label": "График ВВЕ год"
      }
    ],
    "sm": [
      {
        "fieldId": "sm_1_1",
        "source": "Строительный мониторинг",
        "label": "Код АНО СМГ"
      },
      {
        "fieldId": "sm_1_2",
        "source": "Строительный мониторинг",
        "label": "Чек-лист"
      },
      {
        "fieldId": "sm_1_3",
        "source": "Строительный мониторинг",
        "label": "Я.Диск"
      },
      {
        "fieldId": "sm_1_4",
        "source": "Строительный мониторинг",
        "label": "Координаты"
      },
      {
        "fieldId": "sm_1_5",
        "source": "Строительный мониторинг",
        "label": "Дата мониторинга"
      },
      {
        "fieldId": "sm_1_10",
        "source": "Строительный мониторинг",
        "label": "Строительная готовность (план)"
      },
      {
        "fieldId": "sm_1_6",
        "source": "Строительный мониторинг",
        "label": "Строительная готовность (факт)"
      },
      {
        "fieldId": "sm_1_9",
        "source": "Строительный мониторинг",
        "label": "Кол-во людей (план)"
      },
      {
        "fieldId": "sm_1_7",
        "source": "Строительный мониторинг",
        "label": "Кол-во людей (факт)"
      },
      {
        "fieldId": "sm_1_8",
        "source": "Строительный мониторинг",
        "label": "Автослайдер"
      }
    ],
    "ksg": [
      {
        "fieldId": "ksg_1_1",
        "source": "КСГ",
        "label": "Начало_\nПолучение разрешения на строительство (РС)\nДата \nначала\nплан\n(контракт)"
      },
      {
        "fieldId": "ksg_1_2",
        "source": "КСГ",
        "label": "Начало_\nПолучение разрешения на строительство (РС)\nДата \nначала\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_1_3",
        "source": "КСГ",
        "label": "Начало_\nПолучение разрешения на строительство (РС)\nФактическая дата \nначала  (этал.график)"
      },
      {
        "fieldId": "ksg_1_4",
        "source": "КСГ",
        "label": "Начало_\nПолучение разрешения на строительство (РС)\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_2_1",
        "source": "КСГ",
        "label": "Окончание _\nПолучение разрешения на строительство (РС)\nДата \nокончания\nплан (контракт)"
      },
      {
        "fieldId": "ksg_2_2",
        "source": "КСГ",
        "label": "Окончание _\nПолучение разрешения на строительство (РС)\nДата \nокончания\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_2_3",
        "source": "КСГ",
        "label": "Окончание _\nПолучение разрешения на строительство (РС)\nФактическая дата окончания  (этал.график)"
      },
      {
        "fieldId": "ksg_2_4",
        "source": "КСГ",
        "label": "Окончание _\nПолучение разрешения на строительство (РС)\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_3_1",
        "source": "КСГ",
        "label": "Начало_\nПередача Подрядчику строительной площадки \nДата \nначала\nплан\n(контракт)"
      },
      {
        "fieldId": "ksg_3_2",
        "source": "КСГ",
        "label": "Начало_\nПередача Подрядчику строительной площадки \nДата \nначала\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_3_3",
        "source": "КСГ",
        "label": "Начало_\nПередача Подрядчику строительной площадки \nФактическая дата \nначала  (этал.график)"
      },
      {
        "fieldId": "ksg_3_4",
        "source": "КСГ",
        "label": "Начало_\nПередача Подрядчику строительной площадки \nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_4_1",
        "source": "КСГ",
        "label": "Окончание _\nПередача Подрядчику строительной площадки \nДата \nокончания\nплан (контракт)"
      },
      {
        "fieldId": "ksg_4_2",
        "source": "КСГ",
        "label": "Окончание _\nПередача Подрядчику строительной площадки \nДата \nокончания\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_4_3",
        "source": "КСГ",
        "label": "Окончание _\nПередача Подрядчику строительной площадки \nФактическая дата окончания  (этал.график)"
      },
      {
        "fieldId": "ksg_4_4",
        "source": "КСГ",
        "label": "Окончание _\nПередача Подрядчику строительной площадки \nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_5_1",
        "source": "КСГ",
        "label": "Начало СМР\nДата \nначала\nплан\n(контракт)"
      },
      {
        "fieldId": "ksg_5_2",
        "source": "КСГ",
        "label": "Начало СМР\nДата \nначала\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_5_3",
        "source": "КСГ",
        "label": "Начало СМР\nФактическая дата \nначала  (этал.график)"
      },
      {
        "fieldId": "ksg_5_4",
        "source": "КСГ",
        "label": "Начало СМР\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_6_1",
        "source": "КСГ",
        "label": "Окончание СМР\nДата \nокончания\nплан (контракт)"
      },
      {
        "fieldId": "ksg_6_2",
        "source": "КСГ",
        "label": "Окончание СМР\nДата \nокончания\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_6_3",
        "source": "КСГ",
        "label": "Окончание СМР\nФактическая дата окончания  (этал.график)"
      },
      {
        "fieldId": "ksg_6_4",
        "source": "КСГ",
        "label": "Окончание СМР\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_7_1",
        "source": "КСГ",
        "label": "Начало_Получение Актов ТП\nДата \nначала\nплан\n(контракт)"
      },
      {
        "fieldId": "ksg_7_2",
        "source": "КСГ",
        "label": "Начало_Получение Актов ТП\nДата \nначала\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_7_3",
        "source": "КСГ",
        "label": "Начало_Получение Актов ТП\nФактическая дата \nначала  (этал.график)"
      },
      {
        "fieldId": "ksg_7_4",
        "source": "КСГ",
        "label": "Начало_Получение Актов ТП\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_8_1",
        "source": "КСГ",
        "label": "Окончание_Получение Актов ТП\nДата \nокончания\nплан (контракт)"
      },
      {
        "fieldId": "ksg_8_2",
        "source": "КСГ",
        "label": "Окончание_Получение Актов ТП\nДата \nокончания\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_8_3",
        "source": "КСГ",
        "label": "Окончание_Получение Актов ТП\nФактическая дата окончания  (этал.график)"
      },
      {
        "fieldId": "ksg_8_4",
        "source": "КСГ",
        "label": "Окончание_Получение Актов ТП\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_9_1",
        "source": "КСГ",
        "label": "Начало_\nПолучение заключения о соответствии (ЗОС)\nДата \nначала\nплан\n(контракт)"
      },
      {
        "fieldId": "ksg_9_2",
        "source": "КСГ",
        "label": "Начало_\nПолучение заключения о соответствии (ЗОС)\nДата \nначала\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_9_3",
        "source": "КСГ",
        "label": "Начало_\nПолучение заключения о соответствии (ЗОС)\nФактическая дата \nначала  (этал.график)"
      },
      {
        "fieldId": "ksg_9_4",
        "source": "КСГ",
        "label": "Начало_\nПолучение заключения о соответствии (ЗОС)\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_10_1",
        "source": "КСГ",
        "label": "Окончание_\nПолучение заключения о соответствии (ЗОС)\nДата \nокончания\nплан (контракт)"
      },
      {
        "fieldId": "ksg_10_2",
        "source": "КСГ",
        "label": "Окончание_\nПолучение заключения о соответствии (ЗОС)\nДата \nокончания\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_10_3",
        "source": "КСГ",
        "label": "Окончание_\nПолучение заключения о соответствии (ЗОС)\nФактическая дата окончания  (этал.график)"
      },
      {
        "fieldId": "ksg_10_4",
        "source": "КСГ",
        "label": "Окончание_\nПолучение заключения о соответствии (ЗОС)\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_11_1",
        "source": "КСГ",
        "label": "Начало_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\nДата \nначала\nплан\n(контракт)"
      },
      {
        "fieldId": "ksg_11_2",
        "source": "КСГ",
        "label": "Начало_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\nДата \nначала\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_11_3",
        "source": "КСГ",
        "label": "Начало_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\nФактическая дата \nначала  (этал.график)"
      },
      {
        "fieldId": "ksg_11_4",
        "source": "КСГ",
        "label": "Начало_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_12_1",
        "source": "КСГ",
        "label": "Окончание_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\nДата \nокончания\nплан (контракт)"
      },
      {
        "fieldId": "ksg_12_2",
        "source": "КСГ",
        "label": "Окончание_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\nДата \nокончания\nплан (этал.график)"
      },
      {
        "fieldId": "ksg_12_3",
        "source": "КСГ",
        "label": "Окончание_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\nФактическая дата окончания  (этал.график)"
      },
      {
        "fieldId": "ksg_12_4",
        "source": "КСГ",
        "label": "Окончание_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\n№ РВ"
      },
      {
        "fieldId": "ksg_12_5",
        "source": "КСГ",
        "label": "Окончание_\nПолучение разрешения на ввод объекта в эксплуатацию (РВ)\nОтклонение начальной плановой даты к фактической дате по Этал.графику"
      },
      {
        "fieldId": "ksg_12_6",
        "source": "КСГ",
        "label": "Дата обновления информации\n(КСГ обновление данных осуществляется в 11-30 и 18-00)"
      }
    ],
    "suid": [
      {
        "fieldId": "suid_1_1",
        "source": "Замечания СУИД",
        "label": "Бытовые помещения\n(всего)"
      },
      {
        "fieldId": "suid_1_2",
        "source": "Замечания СУИД",
        "label": "Бытовые помещения\n(в работе)"
      },
      {
        "fieldId": "suid_1_3",
        "source": "Замечания СУИД",
        "label": "Бытовые помещения\n(просрочено)"
      },
      {
        "fieldId": "suid_2_1",
        "source": "Замечания СУИД",
        "label": "Временные ограждения\n(всего)"
      },
      {
        "fieldId": "suid_2_2",
        "source": "Замечания СУИД",
        "label": "Временные ограждения\n(в работе)"
      },
      {
        "fieldId": "suid_2_3",
        "source": "Замечания СУИД",
        "label": "Временные ограждения\n(просрочено)"
      },
      {
        "fieldId": "suid_3_1",
        "source": "Замечания СУИД",
        "label": "Культура производства\n(всего)"
      },
      {
        "fieldId": "suid_3_2",
        "source": "Замечания СУИД",
        "label": "Культура производства\n(в работе)"
      },
      {
        "fieldId": "suid_3_3",
        "source": "Замечания СУИД",
        "label": "Культура производства\n(просрочено)"
      },
      {
        "fieldId": "suid_4_1",
        "source": "Замечания СУИД",
        "label": "Качество строительства\n(всего)"
      },
      {
        "fieldId": "suid_4_2",
        "source": "Замечания СУИД",
        "label": "Качество строительства\n(в работе)"
      },
      {
        "fieldId": "suid_4_3",
        "source": "Замечания СУИД",
        "label": "Качество строительства\n(просрочено)"
      },
      {
        "fieldId": "suid_5_1",
        "source": "Замечания СУИД",
        "label": "Неустраненные замечания/просрочено), шт\nБытовые помещения"
      },
      {
        "fieldId": "suid_5_2",
        "source": "Замечания СУИД",
        "label": "Неустраненные замечания/просрочено), шт\nВременные ограждения"
      },
      {
        "fieldId": "suid_5_3",
        "source": "Замечания СУИД",
        "label": "Неустраненные замечания/просрочено), шт\nКультура производства"
      },
      {
        "fieldId": "suid_5_4",
        "source": "Замечания СУИД",
        "label": "Неустраненные замечания/просрочено), шт\nКачество строительства"
      },
      {
        "fieldId": "suid_5_5",
        "source": "Замечания СУИД",
        "label": "Дата обновления информации\n(Замечания СУИД обновление данных осуществляется в 11-30 и 18-00)"
      }
    ],
    "lb": [
      {
        "fieldId": "lb_1_1",
        "source": "Лаборатория",
        "label": "IRI"
      },
      {
        "fieldId": "lb_1_2",
        "source": "Лаборатория",
        "label": "Керн"
      },
      {
        "fieldId": "lb_1_3",
        "source": "Лаборатория",
        "label": "Бетон"
      },
      {
        "fieldId": "lb_1_4",
        "source": "Лаборатория",
        "label": "Прочие исследования"
      },
      {
        "fieldId": "lb_1_5",
        "source": "Лаборатория",
        "label": "IRI\nвсего"
      },
      {
        "fieldId": "lb_1_6",
        "source": "Лаборатория",
        "label": "IRI\nне соответствует"
      },
      {
        "fieldId": "lb_1_7",
        "source": "Лаборатория",
        "label": "Керн\nвсего"
      },
      {
        "fieldId": "lb_1_8",
        "source": "Лаборатория",
        "label": "Керн\nне соответствует"
      },
      {
        "fieldId": "lb_1_9",
        "source": "Лаборатория",
        "label": "Бетон\nвсего"
      },
      {
        "fieldId": "lb_1_10",
        "source": "Лаборатория",
        "label": "Бетон\nне соответствует"
      },
      {
        "fieldId": "lb_1_11",
        "source": "Лаборатория",
        "label": "Прочие исследования\nвсего"
      },
      {
        "fieldId": "lb_1_12",
        "source": "Лаборатория",
        "label": "Прочие исследования\nне соотвтетствует"
      }
    ],
    "ppr": [
      {
        "fieldId": "ppr_1_1",
        "source": "Комплексная оценка объекта",
        "label": "Руководитель проекта (Заказчик)"
      },
      {
        "fieldId": "ppr_1_2",
        "source": "Комплексная оценка объекта",
        "label": "Контактные данные"
      },
      {
        "fieldId": "ppr_1_3",
        "source": "Комплексная оценка объекта",
        "label": "Проблемные вопросы (Строительный мониторинг)"
      },
      {
        "fieldId": "ppr_1_8",
        "source": "Комплексная оценка объекта",
        "label": "Проблемные вопросы (лаборатория)"
      },
      {
        "fieldId": "ppr_1_4",
        "source": "Комплексная оценка объекта",
        "label": "Фактическое состояние объекта"
      },
      {
        "fieldId": "ppr_1_5",
        "source": "Комплексная оценка объекта",
        "label": "Дата прогноза фактического ввода"
      },
      {
        "fieldId": "ppr_1_6",
        "source": "Комплексная оценка объекта",
        "label": "Риск срыва сроков"
      },
      {
        "fieldId": "ppr_1_7",
        "source": "Комплексная оценка объекта",
        "label": "Начало итоговой проверки МГСН (факт)"
      }
    ],
    "mgz": [
      {
        "fieldId": "mgz_1_3",
        "source": "МГЗ",
        "label": "Номер контракта"
      },
      {
        "fieldId": "mgz_1_1",
        "source": "МГЗ",
        "label": "Дата заключения контракта (УК/СМР)"
      },
      {
        "fieldId": "mgz_1_2",
        "source": "МГЗ",
        "label": "Дата исполнения по контракту"
      },
      {
        "fieldId": "mgz_1_4",
        "source": "МГЗ",
        "label": "Продление по контракту"
      },
      {
        "fieldId": "mgz_1_5",
        "source": "МГЗ",
        "label": "Сумма контракта, млрд"
      },
      {
        "fieldId": "mgz_1_6",
        "source": "МГЗ",
        "label": "Профинансировано, млрд"
      },
      {
        "fieldId": "mgz_1_7",
        "source": "МГЗ",
        "label": "% освоения бюджета"
      }
    ]
  });
})();
